IDEA Open Model
SteelSetupRUS Class
Compatible with IDEA StatiCa 20.1
 Steel setup RUS class
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.SteelSetup
 IdeaRS.OpenModel.SteelSetupRUS
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class SteelSetupRUS : SteelSetup
Public Class SteelSetupRUS
	Inherits SteelSetup
The SteelSetupRUS type exposes the following members.
Constructors
Name | Description
SteelSetupRUS
Initializes a new instance of the SteelSetupRUS class
Top
Properties
Name | Description
Anchor_Fiar
 Safety factor Anchor_Fiar
Bolt_Fib
 Safety factor Bolt_Fib
Bolt_Fip
 Safety factor preloaded bolt
CrtBearing
 Concrete bearing factor
PreloadedBoltsLoadType
 WeldingType
Structural_Fi
 Safety factor Structural_Fi
Weld_Fiw
 Safety factor Weld_Fiw
WeldingTypeSNIP
 WeldingType
Top
Methods
Name | Description
FrictionCoefficientPboltDefault
 Friction Coefficient Pbolt Default
 (Overrides SteelSetup.FrictionCoefficientPboltDefault().)
Top
See Also
Reference
IdeaRS.OpenModel Namespace